JMeter Test  Plan KDB.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="scriptPath" elementType="Argument">
            <stringProp name="Argument.name">scriptPath</stringProp>
            <stringProp name="Argument.value">C:/OpenSource/KDB/script.q</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfConcurrentUsers" elementType="Argument">
            <stringProp name="Argument.name">numberOfConcurrentUsers</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="requestPerUser" elementType="Argument">
            <stringProp name="Argument.name">requestPerUser</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${requestPerUser}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${numberOfConcurrentUsers}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="RespTimeGraph.interval">100</stringProp>
        </ResultCollector>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
          <stringProp name="BeanShellSampler.query">import com.google.common.io.Files;
            import org.apache.commons.lang.ArrayUtils;
            import org.apache.commons.lang.StringUtils;


            import java.io.File;
            import java.io.IOException;
            import java.lang.reflect.Array;
            import java.nio.charset.Charset;

            String formatDict(Object object) {
            kx.c.Dict dict = ((kx.c.Dict) object);
            Object[] keys = (Object[]) dict.x;
            StringBuilder sb = new StringBuilder();
            for (int i = 0; i &lt; keys.length; i++) {
            sb.append(ArrayUtils.toString(keys[i]));
            sb.append(&quot;|&quot;);
            sb.append(ArrayUtils.toString(Array.get(dict.y, i)));
            sb.append(&quot;\n&quot;);
            }
            return sb.toString();
            }

            String formatFlip(Object object) {
            kx.c.Flip dict = ((kx.c.Flip) object);
            String[] keys = dict.x;
            StringBuilder sb = new StringBuilder();

            sb.append(String.join(&quot;\t&quot;, keys))
            .append(&quot;\n&quot;)
            .append(StringUtils.repeat(&quot;-&quot;,30))
            .append(&quot;\n&quot;);

            int length = ArrayUtils.getLength(Array.get(dict.y, 0));
            for (int i = 0; i &lt; length; i++) {
            for (int j = 0; j &lt; keys.length; j++) {
            sb.append(Array.get(Array.get(dict.y, j), i));
            sb.append(&quot;\t&quot;);

            }
            sb.append(&quot;\n&quot;);
            }

            return sb.toString();
            }

            String formatKdbResult(Object object) {
            if (object instanceof kx.c.Dict) {
            return formatDict(object);
            } else if (object instanceof kx.c.Flip) {
            return formatFlip(object);
            } else {
            return ArrayUtils.toString(object);
            }
            }

            //simple query to test
            // (`a`b; `c`d`e; enlist `f)!10 20 30
            // flip ([] c1:10 20 30; c2:1.1 2.2 3.3)
            //([] c1:10 20 30; c2:1.1 2.2 3.3)
            kx.c conn = new kx.c(&quot;localhost&quot;, 5001);
            try{
            String query = Files.asCharSource(new File(vars.get(&quot;scriptPath&quot;).toString()), Charset.defaultCharset()).read();

            Object result = conn.k(query);

            String formatted = formatKdbResult(result);
            conn.close();
            return formatted;
            }
            catch (kx.c.KException e){
            return &quot;Error when executing q script:\n&quot; + e.getMessage();
            e.printStackTrace();
            conn.close();
            }



          </stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>